void main(){
  int a = 10, b = 20 ;
// prefix การเพิ่มค่า
  print("ค่า a = $a ") ;
  print("เพิ่มค่า a = ${++a} ") ; // เพิ่มค่าให้ a ก่อนนำไปใช้ 
  print("ค่า a ล่าสุด = $a ") ;

  print("***************************************************************") ;
// profix การเพิ่มค่า 
  a = 10 ;
  print("ค่า a = $a ") ;
  print("เพิ่มค่า a = ${a++} ") ; // นำค่าปัจจุบันใน a ไปใช้ก่อนแล้วค่อยเพิ่มค่าทีหลัง 
  print("ค่า a ล่าสุด = $a ") ;

  print("***************************************************************") ;

// prefix การลดค่า
  print("ค่า b = $b ") ;
  print("ลดค่า b = ${--b} ") ; // ลดค่าให้ b ก่อนนำไปใช้ 
  print("ค่า b ล่าสุด = $b ") ;

  print("***************************************************************") ;
// profix การลดค่า 
  b = 20 ;
  print("ค่า b = $b ") ;
  print("ลดค่า b = ${b--} ") ; // นำค่าปัจจุบันใน b ไปใช้ก่อนแล้วค่อยลดค่าทีหลัง 
  print("ค่า b ล่าสุด = $b ") ;

  print("***************************************************************") ;
}